{"pageProps":{"chapter":{"id":3,"slug":"two-sins-two-deaths-two-confessions","chapter":"Two Sins, Two Deaths, Two Confessions","tagline":"Understanding that not all sin leads to death and how confession differs for believers and unbelievers.","questions":[{"q":"What are the two kinds of sin mentioned in Scripture?","a":"The first is the sin unto death—Adam’s inherited sin nature. The second is sin not unto death—acts committed by ignorance or weakness. The former is removed by Christ’s sacrifice; the latter by continual fellowship.","link":"Read: Episterizo, Chapter 3"},{"q":"What is meant by 'sin unto death'?","a":"It refers to Adam’s sin that brought spiritual death on all mankind. Only Jesus’ death and resurrection dealt with it once and for all.","link":"Read: Episterizo, Chapter 3"},{"q":"Can a believer commit the sin unto death?","a":"No. The believer is no longer in Adam but in Christ. He has passed from death to life; sin unto death cannot be imputed to him.","link":"Read: Episterizo, Chapter 3"},{"q":"What happens when a believer sins after salvation?","a":"He doesn’t lose salvation but breaks fellowship. The remedy is confession of faith, not begging for forgiveness, since sin was already judged in Christ.","link":"Read: Episterizo, Chapter 3"},{"q":"Why do some still confess sins daily?","a":"Because they mistake relationship for fellowship. Salvation is permanent; fellowship is maintained by acknowledging truth, not repeated guilt.","link":"Read: Episterizo, Chapter 3"},{"q":"What are the two types of confession?","a":"The sinner confesses Jesus as Lord for salvation. The saint confesses his faith in what Christ has done, not his faults for forgiveness.","link":"Read: Episterizo, Chapter 3"},{"q":"What does 1 John 1:9 really mean for believers?","a":"It’s not a sinner’s repentance verse but a restoration verse for fellowship. Confession here means agreeing with God’s truth, not re-crucifying Jesus.","link":"Read: Episterizo, Chapter 3"},{"q":"Can confession cleanse sin?","a":"Confession doesn’t cleanse; the blood already has. Confession aligns the believer with the cleansing that’s already a finished work.","link":"Read: Episterizo, Chapter 3"},{"q":"What does it mean that there are two deaths?","a":"The first death is spiritual separation from God; the second is physical death. Jesus died both spiritually and physically to conquer both for us.","link":"Read: Episterizo, Chapter 3"},{"q":"Why must believers understand these two confessions?","a":"Because wrong confession produces fear and guilt. Right confession affirms identity in Christ, keeping the believer established in grace.","link":"Read: Episterizo, Chapter 3"}]}},"__N_SSG":true}